analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/afe_regs.h
/* *****************************************************************************
 * Copyright (C) Analog Devices, All rights Reserved.
 * 
 * This software is protected by copyright laws of the United States and
 * of foreign countries. This material may also be protected by patent laws
 * and technology transfer regulations of the United States and of foreign
 * countries. This software is furnished under a license agreement and/or a
 * nondisclosure agreement and may only be used or reproduced in accordance
 * with the terms of those agreements. Dissemination of this information to
 * any party or parties not specified in the license agreement and/or
 * nondisclosure agreement is expressly prohibited.
 * 
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 * 
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 * 
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 * 
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 **************************************************************************** */

/**
 * @file    afe_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the AFE Peripheral Module.
 */

#ifndef MAX32665_INCLUDE_AFE_REGS_H_
#define MAX32665_INCLUDE_AFE_REGS_H_

/**************************************************************************************************
  Includes
**************************************************************************************************/

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/**************************************************************************************************
  Macros
**************************************************************************************************/

#if defined (__ICCARM__)
#pragma system_include
#endif

#if defined (__CC_ARM)
#pragma anon_unions
#endif
/*/ @cond */
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/*/ @endcond */

/* **** Definitions **** */

/**
 * @ingroup     afe
 * @defgroup    afe_registers AFE_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the AFE Peripheral Module.
 * @details PAN2G5 AFE registers
 */

/**
 * @ingroup afe_registers
 * Structure type to access the AFE Registers.
 */
typedef struct {
    __R  uint8_t rsv_0x0;
    __IO uint8_t  reg1;                           /**< <tt>\b 0x0001:</tt> AFE REG1 Register */
    __IO uint8_t  reg2;                           /**< <tt>\b 0x0002:</tt> AFE REG2 Register */
    __IO uint8_t  reg3;                           /**< <tt>\b 0x0003:</tt> AFE REG3 Register */
    __IO uint8_t  reg4;                           /**< <tt>\b 0x0004:</tt> AFE REG4 Register */
    __IO uint8_t  reg5;                           /**< <tt>\b 0x0005:</tt> AFE REG5 Register */
    __IO uint8_t  reg6;                           /**< <tt>\b 0x0006:</tt> AFE REG6 Register */
    __IO uint8_t  reg7;                           /**< <tt>\b 0x0007:</tt> AFE REG7 Register */
    __IO uint8_t  reg8;                           /**< <tt>\b 0x0008:</tt> AFE REG8 Register */
    __IO uint8_t  reg9;                           /**< <tt>\b 0x0009:</tt> AFE REG9 Register */
    __IO uint8_t  reg10;                          /**< <tt>\b 0x000a:</tt> AFE REG10 Register */
    __IO uint8_t  reg11;                          /**< <tt>\b 0x000b:</tt> AFE REG11 Register */
    __IO uint8_t  reg12;                          /**< <tt>\b 0x000c:</tt> AFE REG12 Register */
    __IO uint8_t  reg13;                          /**< <tt>\b 0x000d:</tt> AFE REG13 Register */
    __IO uint8_t  reg14;                          /**< <tt>\b 0x000e:</tt> AFE REG14 Register */
    __IO uint8_t  reg15;                          /**< <tt>\b 0x000f:</tt> AFE REG15 Register */
    __R  uint32_t rsv_0x10_0x1f[4];
    __IO uint8_t  rega1;                          /**< <tt>\b 0x0020:</tt> AFE REGA1 Register */
    __IO uint8_t  rega2;                          /**< <tt>\b 0x0021:</tt> AFE REGA2 Register */
    __IO uint8_t  rega3;                          /**< <tt>\b 0x0022:</tt> AFE REGA3 Register */
    __IO uint8_t  rega4;                          /**< <tt>\b 0x0023:</tt> AFE REGA4 Register */
    __IO uint8_t  rega5;                          /**< <tt>\b 0x0024:</tt> AFE REGA5 Register */
    __IO uint8_t  rega6;                          /**< <tt>\b 0x0025:</tt> AFE REGA6 Register */
    __IO uint8_t  rega7;                          /**< <tt>\b 0x0026:</tt> AFE REGA7 Register */
    __IO uint8_t  rega8;                          /**< <tt>\b 0x0027:</tt> AFE REGA8 Register */
    __IO int8_t   rega9;                          /**< <tt>\b 0x0028:</tt> AFE REGA9 Register */
    __IO int8_t   rega10;                         /**< <tt>\b 0x0029:</tt> AFE REGA10 Register */
    __IO uint8_t  rega11;                         /**< <tt>\b 0x002a:</tt> AFE REGA11 Register */
    __IO uint8_t  rega12;                         /**< <tt>\b 0x002b:</tt> AFE REGA12 Register */
    __IO uint8_t  rega13;                         /**< <tt>\b 0x002c:</tt> AFE REGA13 Register */
    __IO uint8_t  rega14;                         /**< <tt>\b 0x002d:</tt> AFE REGA14 Register */
    __IO uint8_t  rega15;                         /**< <tt>\b 0x002e:</tt> AFE REGA15 Register */
    __IO uint8_t  rega16;                         /**< <tt>\b 0x002f:</tt> AFE REGA16 Register */
    __IO uint8_t  regb1;                          /**< <tt>\b 0x0030:</tt> AFE REGB1 Register */
    __IO uint8_t  regb2;                          /**< <tt>\b 0x0031:</tt> AFE REGB2 Register */
    __IO uint8_t  regb3;                          /**< <tt>\b 0x0032:</tt> AFE REGB3 Register */
    __IO uint8_t  regb4;                          /**< <tt>\b 0x0033:</tt> AFE REGB4 Register */
    __IO uint8_t  regb5;                          /**< <tt>\b 0x0034:</tt> AFE REGB5 Register */
    __IO uint8_t  regb6;                          /**< <tt>\b 0x0035:</tt> AFE REGB6 Register */
    __IO uint8_t  regb7;                          /**< <tt>\b 0x0036:</tt> AFE REGB7 Register */
} mxc_afe_regs_t;

