analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/afe_regs.h
/* Register offsets for module AFE */
/**
 * @ingroup    afe_registers
 * @defgroup   AFE_Register_Offsets Register Offsets
 * @brief      AFE Peripheral Register Offsets from the AFE Base Peripheral Address.
 * @{
 */
#define MXC_R_AFE_REG1                               ((uint32_t)0x00000001UL) /**< Offset from AFE Base Address: <tt> 0x0001</tt> */
#define MXC_R_AFE_REG2                               ((uint32_t)0x00000002UL) /**< Offset from AFE Base Address: <tt> 0x0002</tt> */
#define MXC_R_AFE_REG3                               ((uint32_t)0x00000003UL) /**< Offset from AFE Base Address: <tt> 0x0003</tt> */
#define MXC_R_AFE_REG4                               ((uint32_t)0x00000004UL) /**< Offset from AFE Base Address: <tt> 0x0004</tt> */
#define MXC_R_AFE_REG5                               ((uint32_t)0x00000005UL) /**< Offset from AFE Base Address: <tt> 0x0005</tt> */
#define MXC_R_AFE_REG6                               ((uint32_t)0x00000006UL) /**< Offset from AFE Base Address: <tt> 0x0006</tt> */
#define MXC_R_AFE_REG7                               ((uint32_t)0x00000007UL) /**< Offset from AFE Base Address: <tt> 0x0007</tt> */
#define MXC_R_AFE_REG8                               ((uint32_t)0x00000008UL) /**< Offset from AFE Base Address: <tt> 0x0008</tt> */
#define MXC_R_AFE_REG9                               ((uint32_t)0x00000009UL) /**< Offset from AFE Base Address: <tt> 0x0009</tt> */
#define MXC_R_AFE_REG10                              ((uint32_t)0x0000000AUL) /**< Offset from AFE Base Address: <tt> 0x000A</tt> */
#define MXC_R_AFE_REG11                              ((uint32_t)0x0000000BUL) /**< Offset from AFE Base Address: <tt> 0x000B</tt> */
#define MXC_R_AFE_REG12                              ((uint32_t)0x0000000CUL) /**< Offset from AFE Base Address: <tt> 0x000C</tt> */
#define MXC_R_AFE_REG13                              ((uint32_t)0x0000000DUL) /**< Offset from AFE Base Address: <tt> 0x000D</tt> */
#define MXC_R_AFE_REG14                              ((uint32_t)0x0000000EUL) /**< Offset from AFE Base Address: <tt> 0x000E</tt> */
#define MXC_R_AFE_REG15                              ((uint32_t)0x0000000FUL) /**< Offset from AFE Base Address: <tt> 0x000F</tt> */
#define MXC_R_AFE_REGA1                              ((uint32_t)0x00000020UL) /**< Offset from AFE Base Address: <tt> 0x0020</tt> */
#define MXC_R_AFE_REGA2                              ((uint32_t)0x00000021UL) /**< Offset from AFE Base Address: <tt> 0x0021</tt> */
#define MXC_R_AFE_REGA3                              ((uint32_t)0x00000022UL) /**< Offset from AFE Base Address: <tt> 0x0022</tt> */
#define MXC_R_AFE_REGA4                              ((uint32_t)0x00000023UL) /**< Offset from AFE Base Address: <tt> 0x0023</tt> */
#define MXC_R_AFE_REGA5                              ((uint32_t)0x00000024UL) /**< Offset from AFE Base Address: <tt> 0x0024</tt> */
#define MXC_R_AFE_REGA6                              ((uint32_t)0x00000025UL) /**< Offset from AFE Base Address: <tt> 0x0025</tt> */
#define MXC_R_AFE_REGA7                              ((uint32_t)0x00000026UL) /**< Offset from AFE Base Address: <tt> 0x0026</tt> */
#define MXC_R_AFE_REGA8                              ((uint32_t)0x00000027UL) /**< Offset from AFE Base Address: <tt> 0x0027</tt> */
#define MXC_R_AFE_REGA9                              ((uint32_t)0x00000028UL) /**< Offset from AFE Base Address: <tt> 0x0028</tt> */
#define MXC_R_AFE_REGA10                             ((uint32_t)0x00000029UL) /**< Offset from AFE Base Address: <tt> 0x0029</tt> */
#define MXC_R_AFE_REGA11                             ((uint32_t)0x0000002AUL) /**< Offset from AFE Base Address: <tt> 0x002A</tt> */
#define MXC_R_AFE_REGA12                             ((uint32_t)0x0000002BUL) /**< Offset from AFE Base Address: <tt> 0x002B</tt> */
#define MXC_R_AFE_REGA13                             ((uint32_t)0x0000002CUL) /**< Offset from AFE Base Address: <tt> 0x002C</tt> */
#define MXC_R_AFE_REGA14                             ((uint32_t)0x0000002DUL) /**< Offset from AFE Base Address: <tt> 0x002D</tt> */
#define MXC_R_AFE_REGA15                             ((uint32_t)0x0000002EUL) /**< Offset from AFE Base Address: <tt> 0x002E</tt> */
#define MXC_R_AFE_REGA16                             ((uint32_t)0x0000002FUL) /**< Offset from AFE Base Address: <tt> 0x002F</tt> */
#define MXC_R_AFE_REGB1                              ((uint32_t)0x00000030UL) /**< Offset from AFE Base Address: <tt> 0x0030</tt> */
#define MXC_R_AFE_REGB2                              ((uint32_t)0x00000031UL) /**< Offset from AFE Base Address: <tt> 0x0031</tt> */
#define MXC_R_AFE_REGB3                              ((uint32_t)0x00000032UL) /**< Offset from AFE Base Address: <tt> 0x0032</tt> */
#define MXC_R_AFE_REGB4                              ((uint32_t)0x00000033UL) /**< Offset from AFE Base Address: <tt> 0x0033</tt> */
#define MXC_R_AFE_REGB5                              ((uint32_t)0x00000034UL) /**< Offset from AFE Base Address: <tt> 0x0034</tt> */
#define MXC_R_AFE_REGB6                              ((uint32_t)0x00000035UL) /**< Offset from AFE Base Address: <tt> 0x0035</tt> */
#define MXC_R_AFE_REGB7                              ((uint32_t)0x00000036UL) /**< Offset from AFE Base Address: <tt> 0x0036</tt> */
/**@} end of group afe_registers */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REG1 AFE_REG1
 * @brief    reg1
 * @{
 */
#define MXC_F_AFE_REG1_FM_DAC_EN_POS                   0 /**< REG1_FM_DAC_EN Position */
#define MXC_F_AFE_REG1_FM_DAC_EN                       ((uint8_t)(0x1UL << MXC_F_AFE_REG1_FM_DAC_EN_POS)) /**< REG1_FM_DAC_EN Mask */

#define MXC_F_AFE_REG1_CP_EN_POS                       1 /**< REG1_CP_EN Position */
#define MXC_F_AFE_REG1_CP_EN                           ((uint8_t)(0x1UL << MXC_F_AFE_REG1_CP_EN_POS)) /**< REG1_CP_EN Mask */

#define MXC_F_AFE_REG1_VCO_EN_POS                      2 /**< REG1_VCO_EN Position */
#define MXC_F_AFE_REG1_VCO_EN                          ((uint8_t)(0x1UL << MXC_F_AFE_REG1_VCO_EN_POS)) /**< REG1_VCO_EN Mask */

#define MXC_F_AFE_REG1_LO_BUF_EN_POS                   3 /**< REG1_LO_BUF_EN Position */
#define MXC_F_AFE_REG1_LO_BUF_EN                       ((uint8_t)(0x1UL << MXC_F_AFE_REG1_LO_BUF_EN_POS)) /**< REG1_LO_BUF_EN Mask */

