analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/afe_regs.h
#define MXC_F_AFE_REG1_DIV_EN_POS                      4 /**< REG1_DIV_EN Position */
#define MXC_F_AFE_REG1_DIV_EN                          ((uint8_t)(0x1UL << MXC_F_AFE_REG1_DIV_EN_POS)) /**< REG1_DIV_EN Mask */

#define MXC_F_AFE_REG1_PA_EN_POS                       5 /**< REG1_PA_EN Position */
#define MXC_F_AFE_REG1_PA_EN                           ((uint8_t)(0x1UL << MXC_F_AFE_REG1_PA_EN_POS)) /**< REG1_PA_EN Mask */

#define MXC_F_AFE_REG1_TX_SW_EN_POS                    6 /**< REG1_TX_SW_EN Position */
#define MXC_F_AFE_REG1_TX_SW_EN                        ((uint8_t)(0x1UL << MXC_F_AFE_REG1_TX_SW_EN_POS)) /**< REG1_TX_SW_EN Mask */

#define MXC_F_AFE_REG1_PLL_BIAS_EN_POS                 7 /**< REG1_PLL_BIAS_EN Position */
#define MXC_F_AFE_REG1_PLL_BIAS_EN                     ((uint8_t)(0x1UL << MXC_F_AFE_REG1_PLL_BIAS_EN_POS)) /**< REG1_PLL_BIAS_EN Mask */

/**@} end of group AFE_REG1_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REG2 AFE_REG2
 * @brief    reg2
 * @{
 */
#define MXC_F_AFE_REG2_CLK_DAC_EN_POS                  6 /**< REG2_CLK_DAC_EN Position */
#define MXC_F_AFE_REG2_CLK_DAC_EN                      ((uint8_t)(0x1UL << MXC_F_AFE_REG2_CLK_DAC_EN_POS)) /**< REG2_CLK_DAC_EN Mask */

#define MXC_F_AFE_REG2_CLK_PA_EN_POS                   7 /**< REG2_CLK_PA_EN Position */
#define MXC_F_AFE_REG2_CLK_PA_EN                       ((uint8_t)(0x1UL << MXC_F_AFE_REG2_CLK_PA_EN_POS)) /**< REG2_CLK_PA_EN Mask */

/**@} end of group AFE_REG2_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REG3 AFE_REG3
 * @brief    reg3
 * @{
 */
#define MXC_F_AFE_REG3_TM_IBOUT_POS                    0 /**< REG3_TM_IBOUT Position */
#define MXC_F_AFE_REG3_TM_IBOUT                        ((uint8_t)(0x7UL << MXC_F_AFE_REG3_TM_IBOUT_POS)) /**< REG3_TM_IBOUT Mask */
#define MXC_V_AFE_REG3_TM_IBOUT_GND_VCO                ((uint8_t)0x0UL) /**< REG3_TM_IBOUT_GND_VCO Value */
#define MXC_S_AFE_REG3_TM_IBOUT_GND_VCO                (MXC_V_AFE_REG3_TM_IBOUT_GND_VCO << MXC_F_AFE_REG3_TM_IBOUT_POS) /**< REG3_TM_IBOUT_GND_VCO Setting */
#define MXC_V_AFE_REG3_TM_IBOUT_IB_VCO                 ((uint8_t)0x1UL) /**< REG3_TM_IBOUT_IB_VCO Value */
#define MXC_S_AFE_REG3_TM_IBOUT_IB_VCO                 (MXC_V_AFE_REG3_TM_IBOUT_IB_VCO << MXC_F_AFE_REG3_TM_IBOUT_POS) /**< REG3_TM_IBOUT_IB_VCO Setting */
#define MXC_V_AFE_REG3_TM_IBOUT_IB_CP                  ((uint8_t)0x2UL) /**< REG3_TM_IBOUT_IB_CP Value */
#define MXC_S_AFE_REG3_TM_IBOUT_IB_CP                  (MXC_V_AFE_REG3_TM_IBOUT_IB_CP << MXC_F_AFE_REG3_TM_IBOUT_POS) /**< REG3_TM_IBOUT_IB_CP Setting */
#define MXC_V_AFE_REG3_TM_IBOUT_IB_FM_MOD              ((uint8_t)0x3UL) /**< REG3_TM_IBOUT_IB_FM_MOD Value */
#define MXC_S_AFE_REG3_TM_IBOUT_IB_FM_MOD              (MXC_V_AFE_REG3_TM_IBOUT_IB_FM_MOD << MXC_F_AFE_REG3_TM_IBOUT_POS) /**< REG3_TM_IBOUT_IB_FM_MOD Setting */
#define MXC_V_AFE_REG3_TM_IBOUT_IB_LOBUF               ((uint8_t)0x4UL) /**< REG3_TM_IBOUT_IB_LOBUF Value */
#define MXC_S_AFE_REG3_TM_IBOUT_IB_LOBUF               (MXC_V_AFE_REG3_TM_IBOUT_IB_LOBUF << MXC_F_AFE_REG3_TM_IBOUT_POS) /**< REG3_TM_IBOUT_IB_LOBUF Setting */
#define MXC_V_AFE_REG3_TM_IBOUT_IB_DIV                 ((uint8_t)0x5UL) /**< REG3_TM_IBOUT_IB_DIV Value */
#define MXC_S_AFE_REG3_TM_IBOUT_IB_DIV                 (MXC_V_AFE_REG3_TM_IBOUT_IB_DIV << MXC_F_AFE_REG3_TM_IBOUT_POS) /**< REG3_TM_IBOUT_IB_DIV Setting */
#define MXC_V_AFE_REG3_TM_IBOUT_IB_REF                 ((uint8_t)0x6UL) /**< REG3_TM_IBOUT_IB_REF Value */
#define MXC_S_AFE_REG3_TM_IBOUT_IB_REF                 (MXC_V_AFE_REG3_TM_IBOUT_IB_REF << MXC_F_AFE_REG3_TM_IBOUT_POS) /**< REG3_TM_IBOUT_IB_REF Setting */
#define MXC_V_AFE_REG3_TM_IBOUT_IB_MON                 ((uint8_t)0x7UL) /**< REG3_TM_IBOUT_IB_MON Value */
#define MXC_S_AFE_REG3_TM_IBOUT_IB_MON                 (MXC_V_AFE_REG3_TM_IBOUT_IB_MON << MXC_F_AFE_REG3_TM_IBOUT_POS) /**< REG3_TM_IBOUT_IB_MON Setting */

#define MXC_F_AFE_REG3_TM_VTUNE_OUT_POS                3 /**< REG3_TM_VTUNE_OUT Position */
#define MXC_F_AFE_REG3_TM_VTUNE_OUT                    ((uint8_t)(0x1UL << MXC_F_AFE_REG3_TM_VTUNE_OUT_POS)) /**< REG3_TM_VTUNE_OUT Mask */

#define MXC_F_AFE_REG3_ADC_TEST_EN_POS                 4 /**< REG3_ADC_TEST_EN Position */
#define MXC_F_AFE_REG3_ADC_TEST_EN                     ((uint8_t)(0x1UL << MXC_F_AFE_REG3_ADC_TEST_EN_POS)) /**< REG3_ADC_TEST_EN Mask */

#define MXC_F_AFE_REG3_CLK_DATA_SEL_POS                5 /**< REG3_CLK_DATA_SEL Position */
#define MXC_F_AFE_REG3_CLK_DATA_SEL                    ((uint8_t)(0x1UL << MXC_F_AFE_REG3_CLK_DATA_SEL_POS)) /**< REG3_CLK_DATA_SEL Mask */
#define MXC_V_AFE_REG3_CLK_DATA_SEL_CLK_DATA           ((uint8_t)0x0UL) /**< REG3_CLK_DATA_SEL_CLK_DATA Value */
#define MXC_S_AFE_REG3_CLK_DATA_SEL_CLK_DATA           (MXC_V_AFE_REG3_CLK_DATA_SEL_CLK_DATA << MXC_F_AFE_REG3_CLK_DATA_SEL_POS) /**< REG3_CLK_DATA_SEL_CLK_DATA Setting */
#define MXC_V_AFE_REG3_CLK_DATA_SEL_XO_OUT             ((uint8_t)0x1UL) /**< REG3_CLK_DATA_SEL_XO_OUT Value */
#define MXC_S_AFE_REG3_CLK_DATA_SEL_XO_OUT             (MXC_V_AFE_REG3_CLK_DATA_SEL_XO_OUT << MXC_F_AFE_REG3_CLK_DATA_SEL_POS) /**< REG3_CLK_DATA_SEL_XO_OUT Setting */

#define MXC_F_AFE_REG3_LF_UGB_EN_POS                   6 /**< REG3_LF_UGB_EN Position */
#define MXC_F_AFE_REG3_LF_UGB_EN                       ((uint8_t)(0x1UL << MXC_F_AFE_REG3_LF_UGB_EN_POS)) /**< REG3_LF_UGB_EN Mask */

/**@} end of group AFE_REG3_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REG4 AFE_REG4
 * @brief    reg4
 * @{
 */
#define MXC_F_AFE_REG4_CP_OFS_POS                      3 /**< REG4_CP_OFS Position */
#define MXC_F_AFE_REG4_CP_OFS                          ((uint8_t)(0x3UL << MXC_F_AFE_REG4_CP_OFS_POS)) /**< REG4_CP_OFS Mask */

/**@} end of group AFE_REG4_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REG5 AFE_REG5
 * @brief    reg5
 * @{
 */
#define MXC_F_AFE_REG5_TM_FMDAC_OUT_POS                6 /**< REG5_TM_FMDAC_OUT Position */
#define MXC_F_AFE_REG5_TM_FMDAC_OUT                    ((uint8_t)(0x3UL << MXC_F_AFE_REG5_TM_FMDAC_OUT_POS)) /**< REG5_TM_FMDAC_OUT Mask */

/**@} end of group AFE_REG5_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REG7 AFE_REG7
 * @brief    reg7
 * @{
 */
#define MXC_F_AFE_REG7_PVTD_TRM_POS                    0 /**< REG7_PVTD_TRM Position */
#define MXC_F_AFE_REG7_PVTD_TRM                        ((uint8_t)(0x1FUL << MXC_F_AFE_REG7_PVTD_TRM_POS)) /**< REG7_PVTD_TRM Mask */

#define MXC_F_AFE_REG7_PVTD_EN_POS                     5 /**< REG7_PVTD_EN Position */
#define MXC_F_AFE_REG7_PVTD_EN                         ((uint8_t)(0x1UL << MXC_F_AFE_REG7_PVTD_EN_POS)) /**< REG7_PVTD_EN Mask */

#define MXC_F_AFE_REG7_SW_ADC_MUX_POS                  0 /**< REG7_SW_ADC_MUX Position */
#define MXC_F_AFE_REG7_SW_ADC_MUX                      ((uint8_t)(0x1FUL << MXC_F_AFE_REG7_SW_ADC_MUX_POS)) /**< REG7_SW_ADC_MUX Mask */
#define MXC_V_AFE_REG7_SW_ADC_MUX_SW_ADC               ((uint8_t)0x0UL) /**< REG7_SW_ADC_MUX_SW_ADC Value */
#define MXC_S_AFE_REG7_SW_ADC_MUX_SW_ADC               (MXC_V_AFE_REG7_SW_ADC_MUX_SW_ADC << MXC_F_AFE_REG7_SW_ADC_MUX_POS) /**< REG7_SW_ADC_MUX_SW_ADC Setting */
#define MXC_V_AFE_REG7_SW_ADC_MUX_ADC_FLAG_I           ((uint8_t)0x1UL) /**< REG7_SW_ADC_MUX_ADC_FLAG_I Value */
#define MXC_S_AFE_REG7_SW_ADC_MUX_ADC_FLAG_I           (MXC_V_AFE_REG7_SW_ADC_MUX_ADC_FLAG_I << MXC_F_AFE_REG7_SW_ADC_MUX_POS) /**< REG7_SW_ADC_MUX_ADC_FLAG_I Setting */
#define MXC_V_AFE_REG7_SW_ADC_MUX_ADC_FLAG_Q           ((uint8_t)0x2UL) /**< REG7_SW_ADC_MUX_ADC_FLAG_Q Value */
#define MXC_S_AFE_REG7_SW_ADC_MUX_ADC_FLAG_Q           (MXC_V_AFE_REG7_SW_ADC_MUX_ADC_FLAG_Q << MXC_F_AFE_REG7_SW_ADC_MUX_POS) /**< REG7_SW_ADC_MUX_ADC_FLAG_Q Setting */
#define MXC_V_AFE_REG7_SW_ADC_MUX_TX_FB_OUT_D          ((uint8_t)0x3UL) /**< REG7_SW_ADC_MUX_TX_FB_OUT_D Value */
#define MXC_S_AFE_REG7_SW_ADC_MUX_TX_FB_OUT_D          (MXC_V_AFE_REG7_SW_ADC_MUX_TX_FB_OUT_D << MXC_F_AFE_REG7_SW_ADC_MUX_POS) /**< REG7_SW_ADC_MUX_TX_FB_OUT_D Setting */
#define MXC_V_AFE_REG7_SW_ADC_MUX_PVTD_FLAG            ((uint8_t)0x4UL) /**< REG7_SW_ADC_MUX_PVTD_FLAG Value */
#define MXC_S_AFE_REG7_SW_ADC_MUX_PVTD_FLAG            (MXC_V_AFE_REG7_SW_ADC_MUX_PVTD_FLAG << MXC_F_AFE_REG7_SW_ADC_MUX_POS) /**< REG7_SW_ADC_MUX_PVTD_FLAG Setting */
#define MXC_V_AFE_REG7_SW_ADC_MUX_PVTD_OUT_D           ((uint8_t)0x5UL) /**< REG7_SW_ADC_MUX_PVTD_OUT_D Value */
#define MXC_S_AFE_REG7_SW_ADC_MUX_PVTD_OUT_D           (MXC_V_AFE_REG7_SW_ADC_MUX_PVTD_OUT_D << MXC_F_AFE_REG7_SW_ADC_MUX_POS) /**< REG7_SW_ADC_MUX_PVTD_OUT_D Setting */

/**@} end of group AFE_REG7_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REG8 AFE_REG8
 * @brief    reg8
 * @{
 */
#define MXC_F_AFE_REG8_D2S_MUX_POS                     6 /**< REG8_D2S_MUX Position */
#define MXC_F_AFE_REG8_D2S_MUX                         ((uint8_t)(0x1UL << MXC_F_AFE_REG8_D2S_MUX_POS)) /**< REG8_D2S_MUX Mask */
#define MXC_V_AFE_REG8_D2S_MUX_IF_MIXER                ((uint8_t)0x0UL) /**< REG8_D2S_MUX_IF_MIXER Value */
#define MXC_S_AFE_REG8_D2S_MUX_IF_MIXER                (MXC_V_AFE_REG8_D2S_MUX_IF_MIXER << MXC_F_AFE_REG8_D2S_MUX_POS) /**< REG8_D2S_MUX_IF_MIXER Setting */
#define MXC_V_AFE_REG8_D2S_MUX_LPF                     ((uint8_t)0x1UL) /**< REG8_D2S_MUX_LPF Value */
#define MXC_S_AFE_REG8_D2S_MUX_LPF                     (MXC_V_AFE_REG8_D2S_MUX_LPF << MXC_F_AFE_REG8_D2S_MUX_POS) /**< REG8_D2S_MUX_LPF Setting */

#define MXC_F_AFE_REG8_SWAP_IQ_POS                     7 /**< REG8_SWAP_IQ Position */
#define MXC_F_AFE_REG8_SWAP_IQ                         ((uint8_t)(0x1UL << MXC_F_AFE_REG8_SWAP_IQ_POS)) /**< REG8_SWAP_IQ Mask */

/**@} end of group AFE_REG8_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REG9 AFE_REG9
 * @brief    reg9
 * @{
 */
#define MXC_F_AFE_REG9_LNA_EN_POS                      0 /**< REG9_LNA_EN Position */
#define MXC_F_AFE_REG9_LNA_EN                          ((uint8_t)(0x1UL << MXC_F_AFE_REG9_LNA_EN_POS)) /**< REG9_LNA_EN Mask */

#define MXC_F_AFE_REG9_MX1_EN_POS                      1 /**< REG9_MX1_EN Position */
#define MXC_F_AFE_REG9_MX1_EN                          ((uint8_t)(0x1UL << MXC_F_AFE_REG9_MX1_EN_POS)) /**< REG9_MX1_EN Mask */

#define MXC_F_AFE_REG9_MX2_EN_POS                      2 /**< REG9_MX2_EN Position */
#define MXC_F_AFE_REG9_MX2_EN                          ((uint8_t)(0x1UL << MXC_F_AFE_REG9_MX2_EN_POS)) /**< REG9_MX2_EN Mask */

#define MXC_F_AFE_REG9_LPF_EN_POS                      3 /**< REG9_LPF_EN Position */
#define MXC_F_AFE_REG9_LPF_EN                          ((uint8_t)(0x1UL << MXC_F_AFE_REG9_LPF_EN_POS)) /**< REG9_LPF_EN Mask */

#define MXC_F_AFE_REG9_CLK_ADC_EN_POS                  4 /**< REG9_CLK_ADC_EN Position */
#define MXC_F_AFE_REG9_CLK_ADC_EN                      ((uint8_t)(0x1UL << MXC_F_AFE_REG9_CLK_ADC_EN_POS)) /**< REG9_CLK_ADC_EN Mask */

#define MXC_F_AFE_REG9_D2S_BUF_EN_POS                  5 /**< REG9_D2S_BUF_EN Position */
#define MXC_F_AFE_REG9_D2S_BUF_EN                      ((uint8_t)(0x1UL << MXC_F_AFE_REG9_D2S_BUF_EN_POS)) /**< REG9_D2S_BUF_EN Mask */

#define MXC_F_AFE_REG9_CON_SW_RW_POS                   6 /**< REG9_CON_SW_RW Position */
#define MXC_F_AFE_REG9_CON_SW_RW                       ((uint8_t)(0x1UL << MXC_F_AFE_REG9_CON_SW_RW_POS)) /**< REG9_CON_SW_RW Mask */

#define MXC_F_AFE_REG9_BIAS_EN_POS                     7 /**< REG9_BIAS_EN Position */
#define MXC_F_AFE_REG9_BIAS_EN                         ((uint8_t)(0x1UL << MXC_F_AFE_REG9_BIAS_EN_POS)) /**< REG9_BIAS_EN Mask */

/**@} end of group AFE_REG9_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REG10 AFE_REG10
 * @brief    reg10
 * @{
 */
#define MXC_F_AFE_REG10_LNA_HG_POS                     0 /**< REG10_LNA_HG Position */
#define MXC_F_AFE_REG10_LNA_HG                         ((uint8_t)(0x3UL << MXC_F_AFE_REG10_LNA_HG_POS)) /**< REG10_LNA_HG Mask */
#define MXC_V_AFE_REG10_LNA_HG_N15_3                   ((uint8_t)0x0UL) /**< REG10_LNA_HG_N15_3 Value */
#define MXC_S_AFE_REG10_LNA_HG_N15_3                   (MXC_V_AFE_REG10_LNA_HG_N15_3 << MXC_F_AFE_REG10_LNA_HG_POS) /**< REG10_LNA_HG_N15_3 Setting */
#define MXC_V_AFE_REG10_LNA_HG_1_5                     ((uint8_t)0x1UL) /**< REG10_LNA_HG_1_5 Value */
#define MXC_S_AFE_REG10_LNA_HG_1_5                     (MXC_V_AFE_REG10_LNA_HG_1_5 << MXC_F_AFE_REG10_LNA_HG_POS) /**< REG10_LNA_HG_1_5 Setting */
#define MXC_V_AFE_REG10_LNA_HG_12_7                    ((uint8_t)0x2UL) /**< REG10_LNA_HG_12_7 Value */
#define MXC_S_AFE_REG10_LNA_HG_12_7                    (MXC_V_AFE_REG10_LNA_HG_12_7 << MXC_F_AFE_REG10_LNA_HG_POS) /**< REG10_LNA_HG_12_7 Setting */
#define MXC_V_AFE_REG10_LNA_HG_24                      ((uint8_t)0x3UL) /**< REG10_LNA_HG_24 Value */
#define MXC_S_AFE_REG10_LNA_HG_24                      (MXC_V_AFE_REG10_LNA_HG_24 << MXC_F_AFE_REG10_LNA_HG_POS) /**< REG10_LNA_HG_24 Setting */

#define MXC_F_AFE_REG10_MX1_HG_POS                     2 /**< REG10_MX1_HG Position */
#define MXC_F_AFE_REG10_MX1_HG                         ((uint8_t)(0x1UL << MXC_F_AFE_REG10_MX1_HG_POS)) /**< REG10_MX1_HG Mask */

#define MXC_F_AFE_REG10_MX2_HG_POS                     3 /**< REG10_MX2_HG Position */
#define MXC_F_AFE_REG10_MX2_HG                         ((uint8_t)(0x1UL << MXC_F_AFE_REG10_MX2_HG_POS)) /**< REG10_MX2_HG Mask */

#define MXC_F_AFE_REG10_LPF_GAIN_POS                   4 /**< REG10_LPF_GAIN Position */
#define MXC_F_AFE_REG10_LPF_GAIN                       ((uint8_t)(0xFUL << MXC_F_AFE_REG10_LPF_GAIN_POS)) /**< REG10_LPF_GAIN Mask */
#define MXC_V_AFE_REG10_LPF_GAIN_0DB                   ((uint8_t)0x0UL) /**< REG10_LPF_GAIN_0DB Value */
#define MXC_S_AFE_REG10_LPF_GAIN_0DB                   (MXC_V_AFE_REG10_LPF_GAIN_0DB << MXC_F_AFE_REG10_LPF_GAIN_POS) /**< REG10_LPF_GAIN_0DB Setting */
#define MXC_V_AFE_REG10_LPF_GAIN_3DB                   ((uint8_t)0x1UL) /**< REG10_LPF_GAIN_3DB Value */
#define MXC_S_AFE_REG10_LPF_GAIN_3DB                   (MXC_V_AFE_REG10_LPF_GAIN_3DB << MXC_F_AFE_REG10_LPF_GAIN_POS) /**< REG10_LPF_GAIN_3DB Setting */
#define MXC_V_AFE_REG10_LPF_GAIN_6DB                   ((uint8_t)0x2UL) /**< REG10_LPF_GAIN_6DB Value */
#define MXC_S_AFE_REG10_LPF_GAIN_6DB                   (MXC_V_AFE_REG10_LPF_GAIN_6DB << MXC_F_AFE_REG10_LPF_GAIN_POS) /**< REG10_LPF_GAIN_6DB Setting */
#define MXC_V_AFE_REG10_LPF_GAIN_9DB                   ((uint8_t)0x3UL) /**< REG10_LPF_GAIN_9DB Value */
#define MXC_S_AFE_REG10_LPF_GAIN_9DB                   (MXC_V_AFE_REG10_LPF_GAIN_9DB << MXC_F_AFE_REG10_LPF_GAIN_POS) /**< REG10_LPF_GAIN_9DB Setting */
#define MXC_V_AFE_REG10_LPF_GAIN_12DB                  ((uint8_t)0x4UL) /**< REG10_LPF_GAIN_12DB Value */
#define MXC_S_AFE_REG10_LPF_GAIN_12DB                  (MXC_V_AFE_REG10_LPF_GAIN_12DB << MXC_F_AFE_REG10_LPF_GAIN_POS) /**< REG10_LPF_GAIN_12DB Setting */
#define MXC_V_AFE_REG10_LPF_GAIN_15DB                  ((uint8_t)0x5UL) /**< REG10_LPF_GAIN_15DB Value */
#define MXC_S_AFE_REG10_LPF_GAIN_15DB                  (MXC_V_AFE_REG10_LPF_GAIN_15DB << MXC_F_AFE_REG10_LPF_GAIN_POS) /**< REG10_LPF_GAIN_15DB Setting */
#define MXC_V_AFE_REG10_LPF_GAIN_18DB                  ((uint8_t)0x6UL) /**< REG10_LPF_GAIN_18DB Value */
#define MXC_S_AFE_REG10_LPF_GAIN_18DB                  (MXC_V_AFE_REG10_LPF_GAIN_18DB << MXC_F_AFE_REG10_LPF_GAIN_POS) /**< REG10_LPF_GAIN_18DB Setting */
#define MXC_V_AFE_REG10_LPF_GAIN_21DB                  ((uint8_t)0x7UL) /**< REG10_LPF_GAIN_21DB Value */
#define MXC_S_AFE_REG10_LPF_GAIN_21DB                  (MXC_V_AFE_REG10_LPF_GAIN_21DB << MXC_F_AFE_REG10_LPF_GAIN_POS) /**< REG10_LPF_GAIN_21DB Setting */
#define MXC_V_AFE_REG10_LPF_GAIN_24DB                  ((uint8_t)0x8UL) /**< REG10_LPF_GAIN_24DB Value */
#define MXC_S_AFE_REG10_LPF_GAIN_24DB                  (MXC_V_AFE_REG10_LPF_GAIN_24DB << MXC_F_AFE_REG10_LPF_GAIN_POS) /**< REG10_LPF_GAIN_24DB Setting */
#define MXC_V_AFE_REG10_LPF_GAIN_27DB                  ((uint8_t)0x9UL) /**< REG10_LPF_GAIN_27DB Value */
#define MXC_S_AFE_REG10_LPF_GAIN_27DB                  (MXC_V_AFE_REG10_LPF_GAIN_27DB << MXC_F_AFE_REG10_LPF_GAIN_POS) /**< REG10_LPF_GAIN_27DB Setting */
#define MXC_V_AFE_REG10_LPF_GAIN_30DB                  ((uint8_t)0xAUL) /**< REG10_LPF_GAIN_30DB Value */
#define MXC_S_AFE_REG10_LPF_GAIN_30DB                  (MXC_V_AFE_REG10_LPF_GAIN_30DB << MXC_F_AFE_REG10_LPF_GAIN_POS) /**< REG10_LPF_GAIN_30DB Setting */
#define MXC_V_AFE_REG10_LPF_GAIN_33DB                  ((uint8_t)0xBUL) /**< REG10_LPF_GAIN_33DB Value */
#define MXC_S_AFE_REG10_LPF_GAIN_33DB                  (MXC_V_AFE_REG10_LPF_GAIN_33DB << MXC_F_AFE_REG10_LPF_GAIN_POS) /**< REG10_LPF_GAIN_33DB Setting */
#define MXC_V_AFE_REG10_LPF_GAIN_36DB                  ((uint8_t)0xCUL) /**< REG10_LPF_GAIN_36DB Value */
#define MXC_S_AFE_REG10_LPF_GAIN_36DB                  (MXC_V_AFE_REG10_LPF_GAIN_36DB << MXC_F_AFE_REG10_LPF_GAIN_POS) /**< REG10_LPF_GAIN_36DB Setting */

/**@} end of group AFE_REG10_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REG11 AFE_REG11
 * @brief    reg11
 * @{
 */
#define MXC_F_AFE_REG11_LNA_BC_POS                     0 /**< REG11_LNA_BC Position */
#define MXC_F_AFE_REG11_LNA_BC                         ((uint8_t)(0x7UL << MXC_F_AFE_REG11_LNA_BC_POS)) /**< REG11_LNA_BC Mask */

#define MXC_F_AFE_REG11_MX1_BW_POS                     3 /**< REG11_MX1_BW Position */
#define MXC_F_AFE_REG11_MX1_BW                         ((uint8_t)(0x7UL << MXC_F_AFE_REG11_MX1_BW_POS)) /**< REG11_MX1_BW Mask */

