analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/afe_regs.h
#define MXC_F_AFE_REG11_DC_DAC_EN_POS                  6 /**< REG11_DC_DAC_EN Position */
#define MXC_F_AFE_REG11_DC_DAC_EN                      ((uint8_t)(0x1UL << MXC_F_AFE_REG11_DC_DAC_EN_POS)) /**< REG11_DC_DAC_EN Mask */

#define MXC_F_AFE_REG11_CLK_DC_DAC_POS                 7 /**< REG11_CLK_DC_DAC Position */
#define MXC_F_AFE_REG11_CLK_DC_DAC                     ((uint8_t)(0x1UL << MXC_F_AFE_REG11_CLK_DC_DAC_POS)) /**< REG11_CLK_DC_DAC Mask */

/**@} end of group AFE_REG11_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REG12 AFE_REG12
 * @brief    reg12
 * @{
 */
#define MXC_F_AFE_REG12_LPF_BW_POS                     0 /**< REG12_LPF_BW Position */
#define MXC_F_AFE_REG12_LPF_BW                         ((uint8_t)(0x7UL << MXC_F_AFE_REG12_LPF_BW_POS)) /**< REG12_LPF_BW Mask */
#define MXC_V_AFE_REG12_LPF_BW_0_76_BW                 ((uint8_t)0x0UL) /**< REG12_LPF_BW_0_76_BW Value */
#define MXC_S_AFE_REG12_LPF_BW_0_76_BW                 (MXC_V_AFE_REG12_LPF_BW_0_76_BW << MXC_F_AFE_REG12_LPF_BW_POS) /**< REG12_LPF_BW_0_76_BW Setting */
#define MXC_V_AFE_REG12_LPF_BW_1_0_BW                  ((uint8_t)0x4UL) /**< REG12_LPF_BW_1_0_BW Value */
#define MXC_S_AFE_REG12_LPF_BW_1_0_BW                  (MXC_V_AFE_REG12_LPF_BW_1_0_BW << MXC_F_AFE_REG12_LPF_BW_POS) /**< REG12_LPF_BW_1_0_BW Setting */
#define MXC_V_AFE_REG12_LPF_BW_1_66_BW                 ((uint8_t)0x7UL) /**< REG12_LPF_BW_1_66_BW Value */
#define MXC_S_AFE_REG12_LPF_BW_1_66_BW                 (MXC_V_AFE_REG12_LPF_BW_1_66_BW << MXC_F_AFE_REG12_LPF_BW_POS) /**< REG12_LPF_BW_1_66_BW Setting */

#define MXC_F_AFE_REG12_LPF_MODE_POS                   3 /**< REG12_LPF_MODE Position */
#define MXC_F_AFE_REG12_LPF_MODE                       ((uint8_t)(0x1UL << MXC_F_AFE_REG12_LPF_MODE_POS)) /**< REG12_LPF_MODE Mask */
#define MXC_V_AFE_REG12_LPF_MODE_500K                  ((uint8_t)0x0UL) /**< REG12_LPF_MODE_500K Value */
#define MXC_S_AFE_REG12_LPF_MODE_500K                  (MXC_V_AFE_REG12_LPF_MODE_500K << MXC_F_AFE_REG12_LPF_MODE_POS) /**< REG12_LPF_MODE_500K Setting */
#define MXC_V_AFE_REG12_LPF_MODE_1M                    ((uint8_t)0x1UL) /**< REG12_LPF_MODE_1M Value */
#define MXC_S_AFE_REG12_LPF_MODE_1M                    (MXC_V_AFE_REG12_LPF_MODE_1M << MXC_F_AFE_REG12_LPF_MODE_POS) /**< REG12_LPF_MODE_1M Setting */

#define MXC_F_AFE_REG12_ADC_SF_POS                     4 /**< REG12_ADC_SF Position */
#define MXC_F_AFE_REG12_ADC_SF                         ((uint8_t)(0x1UL << MXC_F_AFE_REG12_ADC_SF_POS)) /**< REG12_ADC_SF Mask */
#define MXC_V_AFE_REG12_ADC_SF_4_8M                    ((uint8_t)0x0UL) /**< REG12_ADC_SF_4_8M Value */
#define MXC_S_AFE_REG12_ADC_SF_4_8M                    (MXC_V_AFE_REG12_ADC_SF_4_8M << MXC_F_AFE_REG12_ADC_SF_POS) /**< REG12_ADC_SF_4_8M Setting */
#define MXC_V_AFE_REG12_ADC_SF_8M                      ((uint8_t)0x1UL) /**< REG12_ADC_SF_8M Value */
#define MXC_S_AFE_REG12_ADC_SF_8M                      (MXC_V_AFE_REG12_ADC_SF_8M << MXC_F_AFE_REG12_ADC_SF_POS) /**< REG12_ADC_SF_8M Setting */

/**@} end of group AFE_REG12_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REG13 AFE_REG13
 * @brief    reg13
 * @{
 */
#define MXC_F_AFE_REG13_IB_OP_POS                      0 /**< REG13_IB_OP Position */
#define MXC_F_AFE_REG13_IB_OP                          ((uint8_t)(0x3UL << MXC_F_AFE_REG13_IB_OP_POS)) /**< REG13_IB_OP Mask */

#define MXC_F_AFE_REG13_EN_SWING_POS                   2 /**< REG13_EN_SWING Position */
#define MXC_F_AFE_REG13_EN_SWING                       ((uint8_t)(0x7UL << MXC_F_AFE_REG13_EN_SWING_POS)) /**< REG13_EN_SWING Mask */
#define MXC_V_AFE_REG13_EN_SWING_HIZ                   ((uint8_t)0x0UL) /**< REG13_EN_SWING_HIZ Value */
#define MXC_S_AFE_REG13_EN_SWING_HIZ                   (MXC_V_AFE_REG13_EN_SWING_HIZ << MXC_F_AFE_REG13_EN_SWING_POS) /**< REG13_EN_SWING_HIZ Setting */
#define MXC_V_AFE_REG13_EN_SWING_PLL_TX_VCO            ((uint8_t)0x1UL) /**< REG13_EN_SWING_PLL_TX_VCO Value */
#define MXC_S_AFE_REG13_EN_SWING_PLL_TX_VCO            (MXC_V_AFE_REG13_EN_SWING_PLL_TX_VCO << MXC_F_AFE_REG13_EN_SWING_POS) /**< REG13_EN_SWING_PLL_TX_VCO Setting */
#define MXC_V_AFE_REG13_EN_SWING_PLL_LOBUF             ((uint8_t)0x2UL) /**< REG13_EN_SWING_PLL_LOBUF Value */
#define MXC_S_AFE_REG13_EN_SWING_PLL_LOBUF             (MXC_V_AFE_REG13_EN_SWING_PLL_LOBUF << MXC_F_AFE_REG13_EN_SWING_POS) /**< REG13_EN_SWING_PLL_LOBUF Setting */
#define MXC_V_AFE_REG13_EN_SWING_PLL_FM_DAC            ((uint8_t)0x4UL) /**< REG13_EN_SWING_PLL_FM_DAC Value */
#define MXC_S_AFE_REG13_EN_SWING_PLL_FM_DAC            (MXC_V_AFE_REG13_EN_SWING_PLL_FM_DAC << MXC_F_AFE_REG13_EN_SWING_POS) /**< REG13_EN_SWING_PLL_FM_DAC Setting */
#define MXC_V_AFE_REG13_EN_SWING_LPF_CM                ((uint8_t)0x5UL) /**< REG13_EN_SWING_LPF_CM Value */
#define MXC_S_AFE_REG13_EN_SWING_LPF_CM                (MXC_V_AFE_REG13_EN_SWING_LPF_CM << MXC_F_AFE_REG13_EN_SWING_POS) /**< REG13_EN_SWING_LPF_CM Setting */
#define MXC_V_AFE_REG13_EN_SWING_VTUNE                 ((uint8_t)0x6UL) /**< REG13_EN_SWING_VTUNE Value */
#define MXC_S_AFE_REG13_EN_SWING_VTUNE                 (MXC_V_AFE_REG13_EN_SWING_VTUNE << MXC_F_AFE_REG13_EN_SWING_POS) /**< REG13_EN_SWING_VTUNE Setting */
#define MXC_V_AFE_REG13_EN_SWING_VSS                   ((uint8_t)0x7UL) /**< REG13_EN_SWING_VSS Value */
#define MXC_S_AFE_REG13_EN_SWING_VSS                   (MXC_V_AFE_REG13_EN_SWING_VSS << MXC_F_AFE_REG13_EN_SWING_POS) /**< REG13_EN_SWING_VSS Setting */

#define MXC_F_AFE_REG13_MON_SW_POS                     5 /**< REG13_MON_SW Position */
#define MXC_F_AFE_REG13_MON_SW                         ((uint8_t)(0x3UL << MXC_F_AFE_REG13_MON_SW_POS)) /**< REG13_MON_SW Mask */
#define MXC_V_AFE_REG13_MON_SW_IQ                      ((uint8_t)0x0UL) /**< REG13_MON_SW_IQ Value */
#define MXC_S_AFE_REG13_MON_SW_IQ                      (MXC_V_AFE_REG13_MON_SW_IQ << MXC_F_AFE_REG13_MON_SW_POS) /**< REG13_MON_SW_IQ Setting */
#define MXC_V_AFE_REG13_MON_SW_SW_ADC                  ((uint8_t)0x1UL) /**< REG13_MON_SW_SW_ADC Value */
#define MXC_S_AFE_REG13_MON_SW_SW_ADC                  (MXC_V_AFE_REG13_MON_SW_SW_ADC << MXC_F_AFE_REG13_MON_SW_POS) /**< REG13_MON_SW_SW_ADC Setting */
#define MXC_V_AFE_REG13_MON_SW_FM_CNT                  ((uint8_t)0x3UL) /**< REG13_MON_SW_FM_CNT Value */
#define MXC_S_AFE_REG13_MON_SW_FM_CNT                  (MXC_V_AFE_REG13_MON_SW_FM_CNT << MXC_F_AFE_REG13_MON_SW_POS) /**< REG13_MON_SW_FM_CNT Setting */

#define MXC_F_AFE_REG13_SW_ADC_EN_POS                  7 /**< REG13_SW_ADC_EN Position */
#define MXC_F_AFE_REG13_SW_ADC_EN                      ((uint8_t)(0x1UL << MXC_F_AFE_REG13_SW_ADC_EN_POS)) /**< REG13_SW_ADC_EN Mask */

/**@} end of group AFE_REG13_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REG14 AFE_REG14
 * @brief    reg14
 * @{
 */
#define MXC_F_AFE_REG14_FM_CAL_EN_POS                  0 /**< REG14_FM_CAL_EN Position */
#define MXC_F_AFE_REG14_FM_CAL_EN                      ((uint8_t)(0x1UL << MXC_F_AFE_REG14_FM_CAL_EN_POS)) /**< REG14_FM_CAL_EN Mask */

#define MXC_F_AFE_REG14_START_FM_CNT_POS               1 /**< REG14_START_FM_CNT Position */
#define MXC_F_AFE_REG14_START_FM_CNT                   ((uint8_t)(0x1UL << MXC_F_AFE_REG14_START_FM_CNT_POS)) /**< REG14_START_FM_CNT Mask */

#define MXC_F_AFE_REG14_FM_CNT_ADDR_POS                2 /**< REG14_FM_CNT_ADDR Position */
#define MXC_F_AFE_REG14_FM_CNT_ADDR                    ((uint8_t)(0x7UL << MXC_F_AFE_REG14_FM_CNT_ADDR_POS)) /**< REG14_FM_CNT_ADDR Mask */

#define MXC_F_AFE_REG14_FM_RES_POS                     5 /**< REG14_FM_RES Position */
#define MXC_F_AFE_REG14_FM_RES                         ((uint8_t)(0x3UL << MXC_F_AFE_REG14_FM_RES_POS)) /**< REG14_FM_RES Mask */

#define MXC_F_AFE_REG14_TM_CP_UP_POS                   7 /**< REG14_TM_CP_UP Position */
#define MXC_F_AFE_REG14_TM_CP_UP                       ((uint8_t)(0x1UL << MXC_F_AFE_REG14_TM_CP_UP_POS)) /**< REG14_TM_CP_UP Mask */

/**@} end of group AFE_REG14_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REG15 AFE_REG15
 * @brief    reg15
 * @{
 */
#define MXC_F_AFE_REG15_TM_EXT_CLK_POS                 0 /**< REG15_TM_EXT_CLK Position */
#define MXC_F_AFE_REG15_TM_EXT_CLK                     ((uint8_t)(0x1FUL << MXC_F_AFE_REG15_TM_EXT_CLK_POS)) /**< REG15_TM_EXT_CLK Mask */

