analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/afe_regs.h
#define MXC_F_AFE_REG15_TM_CLK_OUT_SEL_POS             5 /**< REG15_TM_CLK_OUT_SEL Position */
#define MXC_F_AFE_REG15_TM_CLK_OUT_SEL                 ((uint8_t)(0x3UL << MXC_F_AFE_REG15_TM_CLK_OUT_SEL_POS)) /**< REG15_TM_CLK_OUT_SEL Mask */

#define MXC_F_AFE_REG15_TCLK_SRC_POS                   7 /**< REG15_TCLK_SRC Position */
#define MXC_F_AFE_REG15_TCLK_SRC                       ((uint8_t)(0x1UL << MXC_F_AFE_REG15_TCLK_SRC_POS)) /**< REG15_TCLK_SRC Mask */

/**@} end of group AFE_REG15_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REGA1 AFE_REGA1
 * @brief    rega1
 * @{
 */
#define MXC_F_AFE_REGA1_FRAC_EN_POS                    1 /**< REGA1_FRAC_EN Position */
#define MXC_F_AFE_REGA1_FRAC_EN                        ((uint8_t)(0x1UL << MXC_F_AFE_REGA1_FRAC_EN_POS)) /**< REGA1_FRAC_EN Mask */

#define MXC_F_AFE_REGA1_DIV_FRAC_POS                   4 /**< REGA1_DIV_FRAC Position */
#define MXC_F_AFE_REGA1_DIV_FRAC                       ((uint8_t)(0xFUL << MXC_F_AFE_REGA1_DIV_FRAC_POS)) /**< REGA1_DIV_FRAC Mask */

/**@} end of group AFE_REGA1_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REGA2 AFE_REGA2
 * @brief    rega2
 * @{
 */
#define MXC_F_AFE_REGA2_DIV_FRAC_POS                   0 /**< REGA2_DIV_FRAC Position */
#define MXC_F_AFE_REGA2_DIV_FRAC                       ((uint8_t)(0xFFUL << MXC_F_AFE_REGA2_DIV_FRAC_POS)) /**< REGA2_DIV_FRAC Mask */

/**@} end of group AFE_REGA2_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REGA3 AFE_REGA3
 * @brief    rega3
 * @{
 */
#define MXC_F_AFE_REGA3_DIV_FRAC_POS                   0 /**< REGA3_DIV_FRAC Position */
#define MXC_F_AFE_REGA3_DIV_FRAC                       ((uint8_t)(0x7UL << MXC_F_AFE_REGA3_DIV_FRAC_POS)) /**< REGA3_DIV_FRAC Mask */

#define MXC_F_AFE_REGA3_DIV_INT_POS                    3 /**< REGA3_DIV_INT Position */
#define MXC_F_AFE_REGA3_DIV_INT                        ((uint8_t)(0x1FUL << MXC_F_AFE_REGA3_DIV_INT_POS)) /**< REGA3_DIV_INT Mask */

/**@} end of group AFE_REGA3_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REGA4 AFE_REGA4
 * @brief    rega4
 * @{
 */
#define MXC_F_AFE_REGA4_SEL_HFP_POS                    3 /**< REGA4_SEL_HFP Position */
#define MXC_F_AFE_REGA4_SEL_HFP                        ((uint8_t)(0x1UL << MXC_F_AFE_REGA4_SEL_HFP_POS)) /**< REGA4_SEL_HFP Mask */
#define MXC_V_AFE_REGA4_SEL_HFP_FM_EN                  ((uint8_t)0x1UL) /**< REGA4_SEL_HFP_FM_EN Value */
#define MXC_S_AFE_REGA4_SEL_HFP_FM_EN                  (MXC_V_AFE_REGA4_SEL_HFP_FM_EN << MXC_F_AFE_REGA4_SEL_HFP_POS) /**< REGA4_SEL_HFP_FM_EN Setting */
#define MXC_V_AFE_REGA4_SEL_HFP_FM_DIS                 ((uint8_t)0x0UL) /**< REGA4_SEL_HFP_FM_DIS Value */
#define MXC_S_AFE_REGA4_SEL_HFP_FM_DIS                 (MXC_V_AFE_REGA4_SEL_HFP_FM_DIS << MXC_F_AFE_REGA4_SEL_HFP_POS) /**< REGA4_SEL_HFP_FM_DIS Setting */

#define MXC_F_AFE_REGA4_F_DEV_POS                      7 /**< REGA4_F_DEV Position */
#define MXC_F_AFE_REGA4_F_DEV                          ((uint8_t)(0x1UL << MXC_F_AFE_REGA4_F_DEV_POS)) /**< REGA4_F_DEV Mask */

/**@} end of group AFE_REGA4_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REGA5 AFE_REGA5
 * @brief    rega5
 * @{
 */
#define MXC_F_AFE_REGA5_F_DEV_POS                      0 /**< REGA5_F_DEV Position */
#define MXC_F_AFE_REGA5_F_DEV                          ((uint8_t)(0xFFUL << MXC_F_AFE_REGA5_F_DEV_POS)) /**< REGA5_F_DEV Mask */

/**@} end of group AFE_REGA5_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REGA6 AFE_REGA6
 * @brief    rega6
 * @{
 */
#define MXC_F_AFE_REGA6_DL_DIV_POS                     0 /**< REGA6_DL_DIV Position */
#define MXC_F_AFE_REGA6_DL_DIV                         ((uint8_t)(0xFUL << MXC_F_AFE_REGA6_DL_DIV_POS)) /**< REGA6_DL_DIV Mask */

#define MXC_F_AFE_REGA6_DL_DAC_POS                     4 /**< REGA6_DL_DAC Position */
#define MXC_F_AFE_REGA6_DL_DAC                         ((uint8_t)(0xFUL << MXC_F_AFE_REGA6_DL_DAC_POS)) /**< REGA6_DL_DAC Mask */

/**@} end of group AFE_REGA6_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REGA7 AFE_REGA7
 * @brief    rega7
 * @{
 */
#define MXC_F_AFE_REGA7_DL_AMP_POS                     0 /**< REGA7_DL_AMP Position */
#define MXC_F_AFE_REGA7_DL_AMP                         ((uint8_t)(0xFUL << MXC_F_AFE_REGA7_DL_AMP_POS)) /**< REGA7_DL_AMP Mask */

#define MXC_F_AFE_REGA7_AMP_COEF_POS                   4 /**< REGA7_AMP_COEF Position */
#define MXC_F_AFE_REGA7_AMP_COEF                       ((uint8_t)(0xFUL << MXC_F_AFE_REGA7_AMP_COEF_POS)) /**< REGA7_AMP_COEF Mask */

/**@} end of group AFE_REGA7_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REGA8 AFE_REGA8
 * @brief    rega8
 * @{
 */
#define MXC_F_AFE_REGA8_DATA_CLK_EN_POS                0 /**< REGA8_DATA_CLK_EN Position */
#define MXC_F_AFE_REGA8_DATA_CLK_EN                    ((uint8_t)(0x1UL << MXC_F_AFE_REGA8_DATA_CLK_EN_POS)) /**< REGA8_DATA_CLK_EN Mask */

#define MXC_F_AFE_REGA8_SDMA_EN_POS                    1 /**< REGA8_SDMA_EN Position */
#define MXC_F_AFE_REGA8_SDMA_EN                        ((uint8_t)(0x1UL << MXC_F_AFE_REGA8_SDMA_EN_POS)) /**< REGA8_SDMA_EN Mask */

#define MXC_F_AFE_REGA8_SEL_AMP_POS                    2 /**< REGA8_SEL_AMP Position */
#define MXC_F_AFE_REGA8_SEL_AMP                        ((uint8_t)(0x1UL << MXC_F_AFE_REGA8_SEL_AMP_POS)) /**< REGA8_SEL_AMP Mask */
#define MXC_V_AFE_REGA8_SEL_AMP_INTERNAL               ((uint8_t)0x0UL) /**< REGA8_SEL_AMP_INTERNAL Value */
#define MXC_S_AFE_REGA8_SEL_AMP_INTERNAL               (MXC_V_AFE_REGA8_SEL_AMP_INTERNAL << MXC_F_AFE_REGA8_SEL_AMP_POS) /**< REGA8_SEL_AMP_INTERNAL Setting */
#define MXC_V_AFE_REGA8_SEL_AMP_EXTERNAL               ((uint8_t)0x1UL) /**< REGA8_SEL_AMP_EXTERNAL Value */
#define MXC_S_AFE_REGA8_SEL_AMP_EXTERNAL               (MXC_V_AFE_REGA8_SEL_AMP_EXTERNAL << MXC_F_AFE_REGA8_SEL_AMP_POS) /**< REGA8_SEL_AMP_EXTERNAL Setting */

#define MXC_F_AFE_REGA8_AM_FIX_POS                     3 /**< REGA8_AM_FIX Position */
#define MXC_F_AFE_REGA8_AM_FIX                         ((uint8_t)(0x1UL << MXC_F_AFE_REGA8_AM_FIX_POS)) /**< REGA8_AM_FIX Mask */
#define MXC_V_AFE_REGA8_AM_FIX_AMP_COEF                ((uint8_t)0x1UL) /**< REGA8_AM_FIX_AMP_COEF Value */
#define MXC_S_AFE_REGA8_AM_FIX_AMP_COEF                (MXC_V_AFE_REGA8_AM_FIX_AMP_COEF << MXC_F_AFE_REGA8_AM_FIX_POS) /**< REGA8_AM_FIX_AMP_COEF Setting */
#define MXC_V_AFE_REGA8_AM_FIX_INTERNAL                ((uint8_t)0x0UL) /**< REGA8_AM_FIX_INTERNAL Value */
#define MXC_S_AFE_REGA8_AM_FIX_INTERNAL                (MXC_V_AFE_REGA8_AM_FIX_INTERNAL << MXC_F_AFE_REGA8_AM_FIX_POS) /**< REGA8_AM_FIX_INTERNAL Setting */

#define MXC_F_AFE_REGA8_FDEV_D2_POS                    4 /**< REGA8_FDEV_D2 Position */
#define MXC_F_AFE_REGA8_FDEV_D2                        ((uint8_t)(0x1UL << MXC_F_AFE_REGA8_FDEV_D2_POS)) /**< REGA8_FDEV_D2 Mask */
#define MXC_V_AFE_REGA8_FDEV_D2_2K                     ((uint8_t)0x0UL) /**< REGA8_FDEV_D2_2K Value */
#define MXC_S_AFE_REGA8_FDEV_D2_2K                     (MXC_V_AFE_REGA8_FDEV_D2_2K << MXC_F_AFE_REGA8_FDEV_D2_POS) /**< REGA8_FDEV_D2_2K Setting */
#define MXC_V_AFE_REGA8_FDEV_D2_4K                     ((uint8_t)0x1UL) /**< REGA8_FDEV_D2_4K Value */
#define MXC_S_AFE_REGA8_FDEV_D2_4K                     (MXC_V_AFE_REGA8_FDEV_D2_4K << MXC_F_AFE_REGA8_FDEV_D2_POS) /**< REGA8_FDEV_D2_4K Setting */

#define MXC_F_AFE_REGA8_DCOCBY_EN_POS                  5 /**< REGA8_DCOCBY_EN Position */
#define MXC_F_AFE_REGA8_DCOCBY_EN                      ((uint8_t)(0x1UL << MXC_F_AFE_REGA8_DCOCBY_EN_POS)) /**< REGA8_DCOCBY_EN Mask */

