analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/afe_regs.h
#define MXC_F_AFE_REGA8_BLE_24MHZ_POS                  6 /**< REGA8_BLE_24MHZ Position */
#define MXC_F_AFE_REGA8_BLE_24MHZ                      ((uint8_t)(0x1UL << MXC_F_AFE_REGA8_BLE_24MHZ_POS)) /**< REGA8_BLE_24MHZ Mask */
#define MXC_V_AFE_REGA8_BLE_24MHZ_24M                  ((uint8_t)0x1UL) /**< REGA8_BLE_24MHZ_24M Value */
#define MXC_S_AFE_REGA8_BLE_24MHZ_24M                  (MXC_V_AFE_REGA8_BLE_24MHZ_24M << MXC_F_AFE_REGA8_BLE_24MHZ_POS) /**< REGA8_BLE_24MHZ_24M Setting */
#define MXC_V_AFE_REGA8_BLE_24MHZ_32M                  ((uint8_t)0x0UL) /**< REGA8_BLE_24MHZ_32M Value */
#define MXC_S_AFE_REGA8_BLE_24MHZ_32M                  (MXC_V_AFE_REGA8_BLE_24MHZ_32M << MXC_F_AFE_REGA8_BLE_24MHZ_POS) /**< REGA8_BLE_24MHZ_32M Setting */

#define MXC_F_AFE_REGA8_INV_FM_POL_POS                 7 /**< REGA8_INV_FM_POL Position */
#define MXC_F_AFE_REGA8_INV_FM_POL                     ((uint8_t)(0x1UL << MXC_F_AFE_REGA8_INV_FM_POL_POS)) /**< REGA8_INV_FM_POL Mask */
#define MXC_V_AFE_REGA8_INV_FM_POL_INV                 ((uint8_t)0x1UL) /**< REGA8_INV_FM_POL_INV Value */
#define MXC_S_AFE_REGA8_INV_FM_POL_INV                 (MXC_V_AFE_REGA8_INV_FM_POL_INV << MXC_F_AFE_REGA8_INV_FM_POL_POS) /**< REGA8_INV_FM_POL_INV Setting */
#define MXC_V_AFE_REGA8_INV_FM_POL_NON_INV             ((uint8_t)0x0UL) /**< REGA8_INV_FM_POL_NON_INV Value */
#define MXC_S_AFE_REGA8_INV_FM_POL_NON_INV             (MXC_V_AFE_REGA8_INV_FM_POL_NON_INV << MXC_F_AFE_REGA8_INV_FM_POL_POS) /**< REGA8_INV_FM_POL_NON_INV Setting */

/**@} end of group AFE_REGA8_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REGA9 AFE_REGA9
 * @brief    rega9 *signed*
 * @{
 */
#define MXC_F_AFE_REGA9_DC_I_POS                       0 /**< REGA9_DC_I Position */
#define MXC_F_AFE_REGA9_DC_I                           ((uint8_t)(0xFFUL << MXC_F_AFE_REGA9_DC_I_POS)) /**< REGA9_DC_I Mask */

/**@} end of group AFE_REGA9_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REGA10 AFE_REGA10
 * @brief    rega10 *signed*
 * @{
 */
#define MXC_F_AFE_REGA10_DC_Q_POS                      0 /**< REGA10_DC_Q Position */
#define MXC_F_AFE_REGA10_DC_Q                          ((uint8_t)(0xFFUL << MXC_F_AFE_REGA10_DC_Q_POS)) /**< REGA10_DC_Q Mask */

/**@} end of group AFE_REGA10_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REGA11 AFE_REGA11
 * @brief    rega11
 * @{
 */
#define MXC_F_AFE_REGA11_IB_DIV_DAC_POS                0 /**< REGA11_IB_DIV_DAC Position */
#define MXC_F_AFE_REGA11_IB_DIV_DAC                    ((uint8_t)(0xFUL << MXC_F_AFE_REGA11_IB_DIV_DAC_POS)) /**< REGA11_IB_DIV_DAC Mask */

#define MXC_F_AFE_REGA11_PLL_IB_RES_POS                4 /**< REGA11_PLL_IB_RES Position */
#define MXC_F_AFE_REGA11_PLL_IB_RES                    ((uint8_t)(0xFUL << MXC_F_AFE_REGA11_PLL_IB_RES_POS)) /**< REGA11_PLL_IB_RES Mask */

/**@} end of group AFE_REGA11_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REGA12 AFE_REGA12
 * @brief    rega12
 * @{
 */
#define MXC_F_AFE_REGA12_IB_VDO_DAC_POS                0 /**< REGA12_IB_VDO_DAC Position */
#define MXC_F_AFE_REGA12_IB_VDO_DAC                    ((uint8_t)(0x7FUL << MXC_F_AFE_REGA12_IB_VDO_DAC_POS)) /**< REGA12_IB_VDO_DAC Mask */

/**@} end of group AFE_REGA12_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REGA13 AFE_REGA13
 * @brief    rega13
 * @{
 */
#define MXC_F_AFE_REGA13_IB_CP_DAC_POS                 0 /**< REGA13_IB_CP_DAC Position */
#define MXC_F_AFE_REGA13_IB_CP_DAC                     ((uint8_t)(0x1FUL << MXC_F_AFE_REGA13_IB_CP_DAC_POS)) /**< REGA13_IB_CP_DAC Mask */

/**@} end of group AFE_REGA13_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REGA14 AFE_REGA14
 * @brief    rega14
 * @{
 */
#define MXC_F_AFE_REGA14_IB_REF_DAC_POS                0 /**< REGA14_IB_REF_DAC Position */
#define MXC_F_AFE_REGA14_IB_REF_DAC                    ((uint8_t)(0xFUL << MXC_F_AFE_REGA14_IB_REF_DAC_POS)) /**< REGA14_IB_REF_DAC Mask */

#define MXC_F_AFE_REGA14_IB_FM_DAC_POS                 4 /**< REGA14_IB_FM_DAC Position */
#define MXC_F_AFE_REGA14_IB_FM_DAC                     ((uint8_t)(0xFUL << MXC_F_AFE_REGA14_IB_FM_DAC_POS)) /**< REGA14_IB_FM_DAC Mask */

/**@} end of group AFE_REGA14_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REGA15 AFE_REGA15
 * @brief    rega15
 * @{
 */
#define MXC_F_AFE_REGA15_IB_LOBUF_DAC_POS              0 /**< REGA15_IB_LOBUF_DAC Position */
#define MXC_F_AFE_REGA15_IB_LOBUF_DAC                  ((uint8_t)(0x7FUL << MXC_F_AFE_REGA15_IB_LOBUF_DAC_POS)) /**< REGA15_IB_LOBUF_DAC Mask */

/**@} end of group AFE_REGA15_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REGA16 AFE_REGA16
 * @brief    rega16
 * @{
 */
#define MXC_F_AFE_REGA16_IB_MX2_TRM_POS                0 /**< REGA16_IB_MX2_TRM Position */
#define MXC_F_AFE_REGA16_IB_MX2_TRM                    ((uint8_t)(0xFUL << MXC_F_AFE_REGA16_IB_MX2_TRM_POS)) /**< REGA16_IB_MX2_TRM Mask */

#define MXC_F_AFE_REGA16_IB_LNA_TRM_POS                4 /**< REGA16_IB_LNA_TRM Position */
#define MXC_F_AFE_REGA16_IB_LNA_TRM                    ((uint8_t)(0xFUL << MXC_F_AFE_REGA16_IB_LNA_TRM_POS)) /**< REGA16_IB_LNA_TRM Mask */

/**@} end of group AFE_REGA16_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REGB1 AFE_REGB1
 * @brief    regb1
 * @{
 */
#define MXC_F_AFE_REGB1_IB_MX1_TRM_POS                 0 /**< REGB1_IB_MX1_TRM Position */
#define MXC_F_AFE_REGB1_IB_MX1_TRM                     ((uint8_t)(0x7UL << MXC_F_AFE_REGB1_IB_MX1_TRM_POS)) /**< REGB1_IB_MX1_TRM Mask */

#define MXC_F_AFE_REGB1_IB_MX1_TC_POS                  4 /**< REGB1_IB_MX1_TC Position */
#define MXC_F_AFE_REGB1_IB_MX1_TC                      ((uint8_t)(0x7UL << MXC_F_AFE_REGB1_IB_MX1_TC_POS)) /**< REGB1_IB_MX1_TC Mask */

/**@} end of group AFE_REGB1_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REGB2 AFE_REGB2
 * @brief    regb2
 * @{
 */
#define MXC_F_AFE_REGB2_ANA_MUX_SEL_POS                0 /**< REGB2_ANA_MUX_SEL Position */
#define MXC_F_AFE_REGB2_ANA_MUX_SEL                    ((uint8_t)(0x7UL << MXC_F_AFE_REGB2_ANA_MUX_SEL_POS)) /**< REGB2_ANA_MUX_SEL Mask */
#define MXC_V_AFE_REGB2_ANA_MUX_SEL_GND_ANA            ((uint8_t)0x0UL) /**< REGB2_ANA_MUX_SEL_GND_ANA Value */
#define MXC_S_AFE_REGB2_ANA_MUX_SEL_GND_ANA            (MXC_V_AFE_REGB2_ANA_MUX_SEL_GND_ANA << MXC_F_AFE_REGB2_ANA_MUX_SEL_POS) /**< REGB2_ANA_MUX_SEL_GND_ANA Setting */
#define MXC_V_AFE_REGB2_ANA_MUX_SEL_TM_RX_IB           ((uint8_t)0x1UL) /**< REGB2_ANA_MUX_SEL_TM_RX_IB Value */
#define MXC_S_AFE_REGB2_ANA_MUX_SEL_TM_RX_IB           (MXC_V_AFE_REGB2_ANA_MUX_SEL_TM_RX_IB << MXC_F_AFE_REGB2_ANA_MUX_SEL_POS) /**< REGB2_ANA_MUX_SEL_TM_RX_IB Setting */
#define MXC_V_AFE_REGB2_ANA_MUX_SEL_TM_PLL_IB          ((uint8_t)0x2UL) /**< REGB2_ANA_MUX_SEL_TM_PLL_IB Value */
#define MXC_S_AFE_REGB2_ANA_MUX_SEL_TM_PLL_IB          (MXC_V_AFE_REGB2_ANA_MUX_SEL_TM_PLL_IB << MXC_F_AFE_REGB2_ANA_MUX_SEL_POS) /**< REGB2_ANA_MUX_SEL_TM_PLL_IB Setting */
#define MXC_V_AFE_REGB2_ANA_MUX_SEL_IF_CM              ((uint8_t)0x3UL) /**< REGB2_ANA_MUX_SEL_IF_CM Value */
#define MXC_S_AFE_REGB2_ANA_MUX_SEL_IF_CM              (MXC_V_AFE_REGB2_ANA_MUX_SEL_IF_CM << MXC_F_AFE_REGB2_ANA_MUX_SEL_POS) /**< REGB2_ANA_MUX_SEL_IF_CM Setting */
#define MXC_V_AFE_REGB2_ANA_MUX_SEL_LPF_CM             ((uint8_t)0x4UL) /**< REGB2_ANA_MUX_SEL_LPF_CM Value */
#define MXC_S_AFE_REGB2_ANA_MUX_SEL_LPF_CM             (MXC_V_AFE_REGB2_ANA_MUX_SEL_LPF_CM << MXC_F_AFE_REGB2_ANA_MUX_SEL_POS) /**< REGB2_ANA_MUX_SEL_LPF_CM Setting */
#define MXC_V_AFE_REGB2_ANA_MUX_SEL_VTUNE_OUT          ((uint8_t)0x5UL) /**< REGB2_ANA_MUX_SEL_VTUNE_OUT Value */
#define MXC_S_AFE_REGB2_ANA_MUX_SEL_VTUNE_OUT          (MXC_V_AFE_REGB2_ANA_MUX_SEL_VTUNE_OUT << MXC_F_AFE_REGB2_ANA_MUX_SEL_POS) /**< REGB2_ANA_MUX_SEL_VTUNE_OUT Setting */

#define MXC_F_AFE_REGB2_TM_RX_IB_EN_POS                4 /**< REGB2_TM_RX_IB_EN Position */
#define MXC_F_AFE_REGB2_TM_RX_IB_EN                    ((uint8_t)(0x3UL << MXC_F_AFE_REGB2_TM_RX_IB_EN_POS)) /**< REGB2_TM_RX_IB_EN Mask */
#define MXC_V_AFE_REGB2_TM_RX_IB_EN_GND_MX2            ((uint8_t)0x0UL) /**< REGB2_TM_RX_IB_EN_GND_MX2 Value */
#define MXC_S_AFE_REGB2_TM_RX_IB_EN_GND_MX2            (MXC_V_AFE_REGB2_TM_RX_IB_EN_GND_MX2 << MXC_F_AFE_REGB2_TM_RX_IB_EN_POS) /**< REGB2_TM_RX_IB_EN_GND_MX2 Setting */
#define MXC_V_AFE_REGB2_TM_RX_IB_EN_LNA_IB             ((uint8_t)0x1UL) /**< REGB2_TM_RX_IB_EN_LNA_IB Value */
#define MXC_S_AFE_REGB2_TM_RX_IB_EN_LNA_IB             (MXC_V_AFE_REGB2_TM_RX_IB_EN_LNA_IB << MXC_F_AFE_REGB2_TM_RX_IB_EN_POS) /**< REGB2_TM_RX_IB_EN_LNA_IB Setting */
#define MXC_V_AFE_REGB2_TM_RX_IB_EN_RF_MIXER_IB        ((uint8_t)0x2UL) /**< REGB2_TM_RX_IB_EN_RF_MIXER_IB Value */
#define MXC_S_AFE_REGB2_TM_RX_IB_EN_RF_MIXER_IB        (MXC_V_AFE_REGB2_TM_RX_IB_EN_RF_MIXER_IB << MXC_F_AFE_REGB2_TM_RX_IB_EN_POS) /**< REGB2_TM_RX_IB_EN_RF_MIXER_IB Setting */
#define MXC_V_AFE_REGB2_TM_RX_IB_EN_IF_MIXER_IB        ((uint8_t)0x3UL) /**< REGB2_TM_RX_IB_EN_IF_MIXER_IB Value */
#define MXC_S_AFE_REGB2_TM_RX_IB_EN_IF_MIXER_IB        (MXC_V_AFE_REGB2_TM_RX_IB_EN_IF_MIXER_IB << MXC_F_AFE_REGB2_TM_RX_IB_EN_POS) /**< REGB2_TM_RX_IB_EN_IF_MIXER_IB Setting */

