analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/afe_regs.h
#define MXC_F_AFE_REGB2_TM_IF_LPF_CMO_SEL_POS          6 /**< REGB2_TM_IF_LPF_CMO_SEL Position */
#define MXC_F_AFE_REGB2_TM_IF_LPF_CMO_SEL              ((uint8_t)(0x1UL << MXC_F_AFE_REGB2_TM_IF_LPF_CMO_SEL_POS)) /**< REGB2_TM_IF_LPF_CMO_SEL Mask */
#define MXC_V_AFE_REGB2_TM_IF_LPF_CMO_SEL_Q            ((uint8_t)0x0UL) /**< REGB2_TM_IF_LPF_CMO_SEL_Q Value */
#define MXC_S_AFE_REGB2_TM_IF_LPF_CMO_SEL_Q            (MXC_V_AFE_REGB2_TM_IF_LPF_CMO_SEL_Q << MXC_F_AFE_REGB2_TM_IF_LPF_CMO_SEL_POS) /**< REGB2_TM_IF_LPF_CMO_SEL_Q Setting */
#define MXC_V_AFE_REGB2_TM_IF_LPF_CMO_SEL_I            ((uint8_t)0x1UL) /**< REGB2_TM_IF_LPF_CMO_SEL_I Value */
#define MXC_S_AFE_REGB2_TM_IF_LPF_CMO_SEL_I            (MXC_V_AFE_REGB2_TM_IF_LPF_CMO_SEL_I << MXC_F_AFE_REGB2_TM_IF_LPF_CMO_SEL_POS) /**< REGB2_TM_IF_LPF_CMO_SEL_I Setting */

#define MXC_F_AFE_REGB2_TM_IF_LPF_CMO_EN_POS           7 /**< REGB2_TM_IF_LPF_CMO_EN Position */
#define MXC_F_AFE_REGB2_TM_IF_LPF_CMO_EN               ((uint8_t)(0x1UL << MXC_F_AFE_REGB2_TM_IF_LPF_CMO_EN_POS)) /**< REGB2_TM_IF_LPF_CMO_EN Mask */

/**@} end of group AFE_REGB2_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REGB3 AFE_REGB3
 * @brief    regb3
 * @{
 */
#define MXC_F_AFE_REGB3_B_OSC_POS                      0 /**< REGB3_B_OSC Position */
#define MXC_F_AFE_REGB3_B_OSC                          ((uint8_t)(0x7FUL << MXC_F_AFE_REGB3_B_OSC_POS)) /**< REGB3_B_OSC Mask */

#define MXC_F_AFE_REGB3_TX_RXB_POS                     7 /**< REGB3_TX_RXB Position */
#define MXC_F_AFE_REGB3_TX_RXB                         ((uint8_t)(0x1UL << MXC_F_AFE_REGB3_TX_RXB_POS)) /**< REGB3_TX_RXB Mask */

/**@} end of group AFE_REGB3_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REGB4 AFE_REGB4
 * @brief    regb4
 * @{
 */
#define MXC_F_AFE_REGB4_PA_LSB_POS                     0 /**< REGB4_PA_LSB Position */
#define MXC_F_AFE_REGB4_PA_LSB                         ((uint8_t)(0x7UL << MXC_F_AFE_REGB4_PA_LSB_POS)) /**< REGB4_PA_LSB Mask */

#define MXC_F_AFE_REGB4_PA_CON_DT_POS                  3 /**< REGB4_PA_CON_DT Position */
#define MXC_F_AFE_REGB4_PA_CON_DT                      ((uint8_t)(0x1FUL << MXC_F_AFE_REGB4_PA_CON_DT_POS)) /**< REGB4_PA_CON_DT Mask */

/**@} end of group AFE_REGB4_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REGB5 AFE_REGB5
 * @brief    regb5
 * @{
 */
#define MXC_F_AFE_REGB5_PA_DT_VCM_POS                  0 /**< REGB5_PA_DT_VCM Position */
#define MXC_F_AFE_REGB5_PA_DT_VCM                      ((uint8_t)(0x3FUL << MXC_F_AFE_REGB5_PA_DT_VCM_POS)) /**< REGB5_PA_DT_VCM Mask */

#define MXC_F_AFE_REGB5_TX_DTCAL_EN_POS                7 /**< REGB5_TX_DTCAL_EN Position */
#define MXC_F_AFE_REGB5_TX_DTCAL_EN                    ((uint8_t)(0x1UL << MXC_F_AFE_REGB5_TX_DTCAL_EN_POS)) /**< REGB5_TX_DTCAL_EN Mask */

/**@} end of group AFE_REGB5_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REGB6 AFE_REGB6
 * @brief    regb6
 * @{
 */
#define MXC_F_AFE_REGB6_PA_CP_POS                      0 /**< REGB6_PA_CP Position */
#define MXC_F_AFE_REGB6_PA_CP                          ((uint8_t)(0xFUL << MXC_F_AFE_REGB6_PA_CP_POS)) /**< REGB6_PA_CP Mask */

#define MXC_F_AFE_REGB6_ADC_SF_POS                     5 /**< REGB6_ADC_SF Position */
#define MXC_F_AFE_REGB6_ADC_SF                         ((uint8_t)(0x7UL << MXC_F_AFE_REGB6_ADC_SF_POS)) /**< REGB6_ADC_SF Mask */
#define MXC_V_AFE_REGB6_ADC_SF_D2                      ((uint8_t)0x0UL) /**< REGB6_ADC_SF_D2 Value */
#define MXC_S_AFE_REGB6_ADC_SF_D2                      (MXC_V_AFE_REGB6_ADC_SF_D2 << MXC_F_AFE_REGB6_ADC_SF_POS) /**< REGB6_ADC_SF_D2 Setting */
#define MXC_V_AFE_REGB6_ADC_SF_D3                      ((uint8_t)0x1UL) /**< REGB6_ADC_SF_D3 Value */
#define MXC_S_AFE_REGB6_ADC_SF_D3                      (MXC_V_AFE_REGB6_ADC_SF_D3 << MXC_F_AFE_REGB6_ADC_SF_POS) /**< REGB6_ADC_SF_D3 Setting */
#define MXC_V_AFE_REGB6_ADC_SF_D4                      ((uint8_t)0x2UL) /**< REGB6_ADC_SF_D4 Value */
#define MXC_S_AFE_REGB6_ADC_SF_D4                      (MXC_V_AFE_REGB6_ADC_SF_D4 << MXC_F_AFE_REGB6_ADC_SF_POS) /**< REGB6_ADC_SF_D4 Setting */
#define MXC_V_AFE_REGB6_ADC_SF_D6                      ((uint8_t)0x3UL) /**< REGB6_ADC_SF_D6 Value */
#define MXC_S_AFE_REGB6_ADC_SF_D6                      (MXC_V_AFE_REGB6_ADC_SF_D6 << MXC_F_AFE_REGB6_ADC_SF_POS) /**< REGB6_ADC_SF_D6 Setting */
#define MXC_V_AFE_REGB6_ADC_SF_D8                      ((uint8_t)0x4UL) /**< REGB6_ADC_SF_D8 Value */
#define MXC_S_AFE_REGB6_ADC_SF_D8                      (MXC_V_AFE_REGB6_ADC_SF_D8 << MXC_F_AFE_REGB6_ADC_SF_POS) /**< REGB6_ADC_SF_D8 Setting */

/**@} end of group AFE_REGB6_Register */

/**
 * @ingroup  afe_registers
 * @defgroup AFE_REGB7 AFE_REGB7
 * @brief    regb7
 * @{
 */
#define MXC_F_AFE_REGB7_VCM1_RX_POS                    0 /**< REGB7_VCM1_RX Position */
#define MXC_F_AFE_REGB7_VCM1_RX                        ((uint8_t)(0xFUL << MXC_F_AFE_REGB7_VCM1_RX_POS)) /**< REGB7_VCM1_RX Mask */

#define MXC_F_AFE_REGB7_VCM2_RX_POS                    4 /**< REGB7_VCM2_RX Position */
#define MXC_F_AFE_REGB7_VCM2_RX                        ((uint8_t)(0xFUL << MXC_F_AFE_REGB7_VCM2_RX_POS)) /**< REGB7_VCM2_RX Mask */

/**@} end of group AFE_REGB7_Register */

#ifdef __cplusplus
}
#endif

#endif // MAX32665_INCLUDE_AFE_REGS_H_
